MOVE SPACES TO WS-CUSTOMER-NAME.

IF WS-CUSTOMER-NAME IS NOT NUMERIC THEN
    IF LENGTH OF WS-CUSTOMER-NAME = 0 THEN
        DISPLAY "Customer name is missing."
    END-IF
END-IF.